/**
 * 変換表
 */
public class ConvertR2KUtill {
    public static final int CHK_LINE = 0;
    public static final int A_DAN    = 1;
    public static final int I_DAN    = 2;
    public static final int U_DAN    = 3;
    public static final int E_DAN    = 4;
    public static final int O_DAN    = 5;
    public static final int OTHER    = 6;

    private static String[][] R2K_MIX_TABLE = {
        {   "", "あ","い","う","え","お" },
        {  "k", "か","き","く","け","こ" },
        {  "s", "さ","し","す","せ","そ" },
        {  "t", "た","ち","つ","て","と" },
        {  "n", "な","に","ぬ","ね","の" },
        {  "h", "は","ひ","ふ","へ","ほ" },
        {  "m", "ま","み","む","め","も" },
        {  "y", "や","い","ゆ","いぇ","よ" },
        {  "r", "ら","り","る","れ","ろ" },
        {  "w", "わ","うぃ","う","うぇ","を" },

        {  "g", "が","ぎ","ぐ","げ","ご" },
        {  "z", "ざ","じ","ず","ぜ","ぞ" },
        {  "j", "じゃ","じ","じゅ","じぇ","じょ" },
        {  "d", "だ","ぢ","づ","で","ど" },
        {  "b", "ば","び","ぶ","べ","ぼ" },
        {  "p", "ぱ","ぴ","ぷ","ぺ","ぽ" },

        { "gy", "ぎゃ","ぎぃ","ぎゅ","ぎぇ","ぎょ" },
        { "zy", "じゃ","じぃ","じゅ","じぇ","じょ" },
        { "jy", "じゃ","じぃ","じゅ","じぇ","じょ" },
        { "dy", "ぢゃ","ぢぃ","ぢゅ","ぢぇ","ぢょ" },
        { "by", "びゃ","びぃ","びゅ","びぇ","びょ" },
        { "py", "ぴゃ","ぴぃ","ぴゅ","ぴぇ","ぴょ" },

        {  "l", "ぁ","ぃ","ぅ","ぇ","ぉ" },
        {  "v", "ヴぁ","ヴぃ","ヴ","ヴぇ","ヴぉ" },
        { "sh", "しゃ","し","しゅ","しぇ","しょ" },
        { "sy", "しゃ","し","しゅ","しぇ","しょ" },
        { "ch", "ちゃ","ち","ちゅ","ちぇ","ちょ" },
        { "cy", "ちゃ","ちぃ","ちゅ","ちぇ","ちょ" },

        {  "f", "ふぁ","ふぃ","ふ","ふぇ","ふぉ" },
        {  "q", "くぁ","くぃ","く","くぇ","くぉ" },
        { "ky", "きゃ","きぃ","きゅ","きぇ","きょ" },
        { "ty", "ちゃ","ちぃ","ちゅ","ちぇ","ちょ" },
        { "ny", "にゃ","にぃ","にゅ","にぇ","にょ" },
        { "hy", "ひゃ","ひぃ","ひゅ","ひぇ","ひょ" },
        { "my", "みゃ","みぃ","みゅ","みぇ","みょ" },
        { "ry", "りゃ","りぃ","りゅ","りぇ","りょ" },
        { "ly", "ゃ","ぃ","ゅ","ぇ","ょ" },
        //{ "lt", "た","ち","っ","て","と" },
        //変更分
        { "lt", "","","っ","","" },

        //追加分
        { "ts", "つぁ","つぃ","つ","つぇ","つぉ" },
        { "wy", "","ゐ","","ゑ","" },
        { "th", "てゃ","てぃ","てゅ","てぇ","てょ" },
        { "dh", "でゃ","でぃ","でゅ","でぇ","でょ" },
        { "wh", "うぁ","うぃ","う","うぇ","うぉ" },
        { "vy", "ヴゃ","ヴぃ","ヴゅ","ヴぇ","ヴょ" },
        { "kw", "くぁ","くぃ","","くぇ","くぉ" },
        { "gw", "ぐぁ","ぐぃ","ぐぅ","ぐぇ","ぐぉ" },
        { "fy", "ふゃ","ふぃ","ふゅ","ふぇ","ふょ" },
        { "lk", "ヵ","","","ヶ","" },
        { "lw", "ゎ","","","","" },
        {  "x", "ぁ","ぃ","ぅ","ぇ","ぉ" },
        { "xk", "ヵ","","","ヶ","" },
        { "xt", "","","っ","","" },
        { "xts", "","","っ","","" },
        { "xy", "ゃ","ぃ","ゅ","ぇ","ょ" },
        { "xw", "ゎ","","","","" },
    };

    private static String[][] R2K_HEBON_TABLE = {
        {   "", "あ","い","う","え","お" },
        {  "k", "か","き","く","け","こ" },
        {  "s", "さ","","す","せ","そ" },
        {  "t", "た","","","て","と" },
        {  "n", "な","に","ぬ","ね","の" },
        {  "h", "は","ひ","","へ","ほ" },
        {  "m", "ま","み","む","め","も" },
        {  "y", "や","","ゆ","","よ" },
        {  "r", "ら","り","る","れ","ろ" },
        {  "w", "わ","","","","" },

        {  "g", "が","ぎ","ぐ","げ","ご" },
        {  "z", "ざ","","ず","ぜ","ぞ" },
        {  "j", "じゃ","じ","じゅ","","じょ" },
        {  "d", "だ","","","で","ど" },
        {  "b", "ば","び","ぶ","べ","ぼ" },
        {  "p", "ぱ","ぴ","ぷ","ぺ","ぽ" },
        { "gy", "ぎゃ","","ぎゅ","","ぎょ" },
        { "by", "びゃ","","びゅ","","びょ" },
        { "py", "ぴゃ","","ぴゅ","","ぴょ" },

        {  "v", "ヴぁ","ヴぃ","ヴ","ヴぇ","ヴぉ" },
        { "sh", "しゃ","し","しゅ","","しょ" },
        { "ch", "ちゃ","ち","ちゅ","","ちょ" },

        {  "f", "","","ふ","","" },
        { "ky", "きゃ","","きゅ","","きょ" },
        { "ny", "にゃ","","にゅ","","にょ" },
        { "hy", "ひゃ","","ひゅ","","ひょ" },
        { "my", "みゃ","","みゅ","","みょ" },
        { "ry", "りゃ","","りゅ","","りょ" },
        { "ts", "","","つ","","" },
    };

    /**
     * 変換テーブルの取得
     */
    public static String[][] getConvertTable(int type) {
        //TODO:typeでヘボン式のみのテーブルを返却したり、訓令式のみのテーブルを返却したり
        String[][] ret = R2K_MIX_TABLE;
        switch(type){
            case ConvertR2K.CONVERT_TYPE_MIX:
                ret = R2K_MIX_TABLE;
                break;
            case ConvertR2K.CONVERT_TYPE_HEBON:
                ret = R2K_HEBON_TABLE;
                break;
            default:
                break;
        }
        return ret;
    }

    /**
     * 文字種別の判定
     */
    public static int charType(String s) {
        int ret = OTHER;
        if(s.equals("a")) {
            ret = A_DAN;
        } else if(s.equals("i")) {
            ret = I_DAN;
        } else if(s.equals("u")) {
            ret = U_DAN;
        } else if(s.equals("e")) {
            ret = E_DAN;
        } else if(s.equals("o")) {
            ret = O_DAN;
        }
        return ret;
    }
}
